queens_aaa_workflow/openfoam_cases/case_001/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-38.572729 -25.527507 -56.091595)
    (75.294287 -25.527507 -56.091595)
    (75.294287 154.864964 -56.091595)
    (-38.572729 154.864964 -56.091595)
    (-38.572729 -25.527507 56.091595)
    (75.294287 -25.527507 56.091595)
    (75.294287 154.864964 56.091595)
    (-38.572729 154.864964 56.091595)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (228 361 225) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
